---
kind: type
id: T:Autodesk.Revit.UI.DockablePanes.BuiltInDockablePanes
source: html/03b7f98b-7e0d-8fa6-052c-f9192ff86ca8.htm
---
# Autodesk.Revit.UI.DockablePanes.BuiltInDockablePanes

A collection of ids of the dockable panes provided by Revit.

## Syntax (C#)
```csharp
public static class BuiltInDockablePanes
```